# Handling Missing Data

With some datasets, you will encounter missing data.  I will go over how to handle missing data by first check to see if you have missing values in your dataset. There are many ways to handle missing values such as dropping an entire row of nulls, dropping an entire row that has only a  null, filling in missing values with the previous, next, or average value.

In [1]:
import numpy as np
import pandas as pd

In [2]:
# dictionary of lists, example is systolic blood pressure reading (top number)
dict = {'systolic_1':[161, 188, np.nan, 212], 
        'systolic_2': [87, 105, 93, np.nan], 
        'systolic_3':[np.nan, 117, 112, 122]}
dict

{'systolic_1': [161, 188, nan, 212],
 'systolic_2': [87, 105, 93, nan],
 'systolic_3': [nan, 117, 112, 122]}

In [3]:
# creating a pandas dataframe from python dictionary 
df = pd.DataFrame(dict) 
df

   systolic_1  systolic_2  systolic_3
0       161.0        87.0         NaN
1       188.0       105.0       117.0
2         NaN        93.0       112.0
3       212.0         NaN       122.0

## Check for Null Values

In [4]:
# using isnull() function to check for missing values, gives boolean values
df.isnull() 
# df.isna() gives the same boolean values

   systolic_1  systolic_2  systolic_3
0       False       False        True
1       False       False       False
2        True       False       False
3       False        True       False

In [5]:
# Gives the total of null values per column
df.isna().sum()

systolic_1    1
systolic_2    1
systolic_3    1
dtype: int64

## Filling in Missing Values

In [6]:
# filling missing value using fillna()
# You can select a particular value to replace NaN such as 0, 1, -1
df1 = df.fillna(-1) 
df1

   systolic_1  systolic_2  systolic_3
0       161.0        87.0        -1.0
1       188.0       105.0       117.0
2        -1.0        93.0       112.0
3       212.0        -1.0       122.0

In [7]:
# will replace  a particular value in dataframe with another value
# df1.replace(to_replace = NaN, value = 1) example

df1.replace(to_replace = -1, value = 0, inplace=True) 
df1

   systolic_1  systolic_2  systolic_3
0       161.0        87.0         0.0
1       188.0       105.0       117.0
2         0.0        93.0       112.0
3       212.0         0.0       122.0

In [8]:
df

   systolic_1  systolic_2  systolic_3
0       161.0        87.0         NaN
1       188.0       105.0       117.0
2         NaN        93.0       112.0
3       212.0         NaN       122.0

In [9]:
# To interpolate the missing values means to take the average of the previous and next values.
# Note that Linear method ignore the index and treat the values as equally spaced. 

df2 = df.interpolate(method ='linear', limit_direction ='forward') 
df2

   systolic_1  systolic_2  systolic_3
0       161.0        87.0         NaN
1       188.0       105.0       117.0
2       200.0        93.0       112.0
3       212.0        93.0       122.0

In [10]:
# Verify NaN index position
# iloc means integer position-based
df2.iloc[0,2]

nan

In [11]:
# Manually reset value to have the same as the next value
df2.iloc[0,2] = 117.0
df2

   systolic_1  systolic_2  systolic_3
0       161.0        87.0       117.0
1       188.0       105.0       117.0
2       200.0        93.0       112.0
3       212.0        93.0       122.0

In [12]:
# Revert back to dataframe with NaNs
df

   systolic_1  systolic_2  systolic_3
0       161.0        87.0         NaN
1       188.0       105.0       117.0
2         NaN        93.0       112.0
3       212.0         NaN       122.0

## Dropping Null Values

In [13]:
# Drop rows with at least 1 Nan value
# df.dropna(how = 'any'), it looks for any NaNs in a row and will drop it
df3 = df.dropna()
df3

   systolic_1  systolic_2  systolic_3
1       188.0       105.0       117.0

In [14]:
# Create a situation where an entire row has NaNs
df.iloc[0,0]=np.nan
df.iloc[0,1]=np.nan
df
# Now, notice below that row 0 has all NaNs

   systolic_1  systolic_2  systolic_3
0         NaN         NaN         NaN
1       188.0       105.0       117.0
2         NaN        93.0       112.0
3       212.0         NaN       122.0

In [15]:
#  drop a rows whose all data is missing or contain null values(NaN)
# row 0 has been dropped because there were all NaN values in the row
df4 = df.dropna(how = 'all')
df4

   systolic_1  systolic_2  systolic_3
1       188.0       105.0       117.0
2         NaN        93.0       112.0
3       212.0         NaN       122.0

In [16]:
#  I did not use inplace=True as a second argument so I am able to recover the dataframe without the changes.
df

   systolic_1  systolic_2  systolic_3
0         NaN         NaN         NaN
1       188.0       105.0       117.0
2         NaN        93.0       112.0
3       212.0         NaN       122.0

In [17]:
# Let's set values
df.iloc[0,0] = 161.0
df.iloc[0,1] = 87.0
df

   systolic_1  systolic_2  systolic_3
0       161.0        87.0         NaN
1       188.0       105.0       117.0
2         NaN        93.0       112.0
3       212.0         NaN       122.0

In [18]:
# filling a missing value with previous ones:  df.fillna(method = 'pad')
df5 = df.fillna(method = 'pad')  # fill values forward
df5

   systolic_1  systolic_2  systolic_3
0       161.0        87.0         NaN
1       188.0       105.0       117.0
2       188.0        93.0       112.0
3       212.0        93.0       122.0

In [19]:
df

   systolic_1  systolic_2  systolic_3
0       161.0        87.0         NaN
1       188.0       105.0       117.0
2         NaN        93.0       112.0
3       212.0         NaN       122.0

In [20]:
# filling a missing value with the next one:  df.fillna(method='bfill')
df6 = df.fillna(method='bfill')  # Fill values backward
df6

   systolic_1  systolic_2  systolic_3
0       161.0        87.0       117.0
1       188.0       105.0       117.0
2       212.0        93.0       112.0
3       212.0         NaN       122.0

In [ ]:
# end